#include <RichEdit/RichEdit.h>

using namespace Upp;

const char *examples[] = {
	"Нормальный [* полужирный] [/ курсив] [_ подчёркнутый] [` надписной] [, подписной]",
	"`[ `] \1[с искейпом]\1 [* полужирный]",
	"[A Arial (Sans-Serif)] [R Times New Roman (Serif)] [C Courier (Monospace)]",
	"[0 6pt ][1 8pt ][2 10pt ][3 12pt ][4 16pt ][5 20pt ][6 24pt ][7 28pt ][8 36pt ][9 48pt ]",
	"[!Tahoma! Tahoma]",
	"[+500 500dots]",
	"[@4 Зелёный текст] [$(255.220.200) Розовый фон]",
	"[%EN-US Английский язык] [%CS-CZ Чешский язык]",
	"[^upp.sf.net^ Гиперссылка] [Icompiler, linker; Индексная запись]",
	"[:label: Параграф с ярлыком]",
	"[< Параграф размещён соева]",
	"[= Параграф размещён по центру]",
	"[> Параграф размещён справа]",
	"[# Растянуть раскладку. Небольшой текст для демо... "
	"Небольшой текст для демо... Небольшой текст для демо...]",
	"[l1000 Левая кромка 1000 точек]",
	"[i1000 Отступ 1000 точек."
	"Небольшой текст для демо... Небольшой текст для демо...]",
	"[r1000 Right margin 1000 dots."
	"Небольшой текст для демо... Небольшой текст для демо...]",
	"Параграф&[b200 Перед ним 200 точек]",
	"[a200 После него 200 точек]&Параграф",
	"[i200 [O0 буллет&][O1 буллет&][O2 буллет&][O3 буллет]]",
	"[O9i500 текст-буллет-|"
	"Небольшой текст для демо... Небольшой текст для демо..."
	"Небольшой текст для демо... Небольшой текст для демо...]",
	"[O9i200 [N1m.; -|уровень 1&][N1a -|уровень 2&][N1a -|уровень 2&][N1 -|уровень 1&][N1a -|уровень 2]]",
	"[~300~=.2000~>-3000 -|Нормальный таб-|Таб по центру-|Таб справа]",
	"{{1:2 A1:: A2:: B1:: B2}}",
	"{{2:1G4g100F5f50 A1:: A2:: B1:: B2}}",
	"{{1:2 A1::l40/60R6@3 A2::! B1:: B2}}",
	"{{1:1:1|2 A1::-2 A2:: A3:: B1:: B2:: B3}}",
	"{{1:2 A1:: A2:: B1:: {{1:2 a1:: a2:: a1:: a2}}}}",
	"{{1~a30/50o Круглый бордюр}}",
	NULL 
};

GUI_APP_MAIN
{
	SetLanguage("ru-ru");

	String qtf = "&";
	for(int i = 0; examples[i]; i++)
		qtf << "{{1 [@3C1* " << DeQtf(AsCString(examples[i])) << "]:: " << examples[i] << "}}&&";
	RichEditWithToolBar e;
	e.SetQTF(qtf);
	TopWindow w;
	w.Sizeable().Zoomable();
	w.Add(e.SizePos());
	w.Run();
}
